# SQL Joins: TMDb Database
#### © Explore Data Science Academy

## Instructions to Students

This challenge was designed to determine how much have been learned so far and to test knowledge on  SQL JOIN statements.

Questions were provided which were answered using SQL Queries in attempt to test my understanding of the subject matter.

## Honour Code

I YINKA, AKINDELE, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abided by the EDSA honour code.

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb Database

In this challenge I explored the [The Movie Database](https://www.themoviedb.org/) - an online movie and TV show database, which houses some of the most popular movies and TV shows at your finger tips. The TMDb database supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="images/sql_tmdb.jpg" width=80%/>


Below is an Entity Relationship diagram(ERD) of the TMDb database:

<img src="images/TMDB_ER_diagram.png" width=70%/>

As can be seen from the ER diagram, the TMDb database consists of `12 tables` containing information about movies, cast, genre and so much more.  



#### Getting started!

This challenge is designed test your knowledge on SQL join statements. Based on the TMDb dataset.

## Loading the database

The SQL environment was prepared by loading in the magic command below in order to use SQL queries.

The database, TMDB.db, was then loaded into the SQL environment in the following cell.

In [1]:
%load_ext sql

In [2]:
%%sql 

sqlite:///data/TMDB.db

<br>
<br>

#### The query below was used to view all the tables in the database

In [3]:
%%sql
SELECT name FROM sqlite_master WHERE type IN ('table', 'view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///data/TMDB.db
Done.

[('Alan_Rickman_Movies',),
 ('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

<br>
<br>

## Questions on SQL Join Statements 

#### In the following cells, questions were provided that are to be answered from the database using SQL queries.

### Question

What is the primary key for the table “movies”?

**Solution**

In [4]:
%%sql

PRAGMA table_info(movies)

 * sqlite:///data/TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

### Question

How many foreign keys does the “LanguageMap” table have?

**Solution**

In [5]:
%%sql 

PRAGMA table_info(LanguageMap)

 * sqlite:///data/TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'iso_639_1', 'char(2)', 1, None, 2)]

### Question

How many movies in the database were produced by Pixar Animation Studios?

**Solution**

In [6]:
%%sql 

SELECT count(DISTINCT m.movie_id) AS "Number_of_movies_produced_by_Pixar"
FROM movies m, productioncompanies pc, productioncompanymap pcm
WHERE m.movie_id = pcm.movie_id
    AND pcm.production_company_id = pc.production_company_id
    AND pC.production_company_name = "Pixar Animation Studios"

 * sqlite:///data/TMDB.db
Done.

[(16,)]

### Question

What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

**Solution**

In [7]:
%%sql 

SELECT m.title AS "Most_popular_action_movie_that_has_German_in_it"
FROM movies m, genres g, languages l, languagemap lm
WHERE m.movie_id = lm.movie_id
    AND l.iso_639_1 = lm.iso_639_1
    AND g.genre_name = "Action"
    AND l.language_name = "Deutsch"
ORDER BY popularity DESC
LIMIT 5;

 * sqlite:///data/TMDB.db
Done.

[('Captain America: Civil War',),
 ('Mission: Impossible - Rogue Nation',),
 ('The Fifth Element',),
 ('Quantum of Solace',),
 ('Spectre',)]

### Question

In how many movies did Tom Cruise portray the character Ethan Hunt? (Hint: Characters are listed in the Casts table.)

**Solution**

In [8]:
%%sql

SELECT count(m.movie_id) AS "Number_movies_that_Tom_cruise_was_Ethan_Hunt"
FROM movies m, actors ar, casts c
WHERE m.movie_id = c.movie_id
    AND c.actor_id = ar.actor_id
    AND ar.actor_name = "Tom Cruise"
    AND c.characters = "Ethan Hunt"

 * sqlite:///data/TMDB.db
Done.

[(5,)]

### Question

How many times was the actress Cate Blanchett nominated for an Oscar?

**Solution**

In [9]:
%%sql

SELECT count(name) AS "Number_of_times_Cate_Blanchett_was_nominated_for_Oscar"
FROM oscars
WHERE name = "Cate Blanchett"

 * sqlite:///data/TMDB.db
Done.

[(7,)]

### Question

How many movies were nominated for the Best Picture award at the Oscars?

**Solution**

In [10]:
%%sql 

SELECT count(m.movie_id) AS "Number_o_movies_nominated_for_best_Picture_at_Oscar"
FROM movies m, oscars os
WHERE os.name = m.title
AND lower(os.award) = "best picture"

 * sqlite:///data/TMDB.db
Done.

[(8,)]

### Question

How many movies contain at least one of the languages, Afrikaans or Zulu?

**Solution**

In [11]:
%%sql

SELECT count(DISTINCT m.movie_id) AS "Number_of_movies_with_Afrikaans_or_Zulu"
FROM movies AS m
INNER JOIN  languagemap AS lm
ON m.movie_id = lm.movie_id
INNER JOIN languages AS l
ON lm.iso_639_1 = l.iso_639_1
WHERE lower(l.language_name) = "afrikaans"
    OR lower(l.language_name) = "isizulu"

 * sqlite:///data/TMDB.db
Done.

[(8,)]

### Question

In which country was the movie “Star Wars” produced?

**Solution**

In [12]:
%%sql

SELECT pc.production_country_name
FROM movies AS m
INNER JOIN productioncountrymap AS pcm
ON m.movie_id = pcm.movie_id
INNER JOIN productioncountries pc
ON pcm.iso_3166_1 = pc.iso_3166_1
WHERE m.title = "Star Wars"

 * sqlite:///data/TMDB.db
Done.

[('United States of America',)]

### Question

How many movies are in the database that are both a Romance and a Comedy?

**Solution**

In [13]:
%%sql

SELECT count(*) AS "Number_of_movies_that_are_romance_and_comedy" FROM (SELECT m.movie_id
FROM movies AS m
INNER JOIN genremap AS gm
ON m.movie_id = gm.movie_id
INNER JOIN genres AS g
ON g.genre_id = gm.genre_id
WHERE g.genre_name = "Romance"

INTERSECT

SELECT m.movie_id
FROM movies AS m
INNER JOIN genremap AS gm
ON m.movie_id = gm.movie_id
INNER JOIN genres AS g
ON g.genre_id = gm.genre_id
WHERE g.genre_name = "Comedy")

 * sqlite:///data/TMDB.db
Done.

[(484,)]